RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_gpio.h
#define CY_GPIO_IS_AMUX_CONNECT_VALID(amuxConnect)    ((CY_GPIO_AMUX_OPENALL == (amuxConnect)) || \
                                                       (CY_GPIO_AMUX_L       == (amuxConnect)) || \
                                                       (CY_GPIO_AMUX_R       == (amuxConnect)) || \
                                                       (CY_GPIO_AMUX_LR      == (amuxConnect)) || \
                                                       (CY_GPIO_AMUX_G       == (amuxConnect)) || \
                                                       (CY_GPIO_AMUX_GL      == (amuxConnect)) || \
                                                       (CY_GPIO_AMUX_GR      == (amuxConnect)) || \
                                                       (CY_GPIO_AMUX_GLR     == (amuxConnect)))

#define CY_GPIO_IS_AMUX_SELECT_VALID(amuxBus)       ((CY_GPIO_AMUXBUSA       == (amuxBus)) || \
                                                     (CY_GPIO_AMUXBUSB       == (amuxBus)))

#if defined (CY_IP_MXS40IOSS)
#define CY_GPIO_IS_DRIVE_SEL_VALID(driveSel)   ((CY_GPIO_DRIVE_FULL    == (driveSel)) || \
                                                (CY_GPIO_DRIVE_1_2     == (driveSel)) || \
                                                (CY_GPIO_DRIVE_1_4     == (driveSel)) || \
                                                (CY_GPIO_DRIVE_1_8     == (driveSel)))
#else
#define CY_GPIO_IS_HSIOM_SEC_VALID(secValue)   (0U == ((secValue) & (uint32_t)~CY_GPIO_HSIOM_SEC_MASK))
#define CY_GPIO_IS_SLEW_RATE_VALID(slewRate)   (0U == ((slewRate) & (uint32_t)~CY_GPIO_CFG_SLEW_EXT_MASK))
#define CY_GPIO_IS_DRIVE_SEL_VALID(driveSel)   (0U == ((driveSel) & (uint32_t)~CY_GPIO_CFG_DRIVE_SEL_EXT_MASK))
#endif /* CY_IP_MXS40IOSS */

/** \endcond */


/***************************************
*        Function Constants
***************************************/

/**
* \addtogroup group_gpio_macros
* \{
*/

/**
* \defgroup group_gpio_driveModes Pin drive mode
* \{
* Constants to be used for setting the drive mode of the pin. There are eight
* primary drive modes.
* Below diagrams are simplified output driver diagrams of the pin view for the
* CPU register and UDB/DSI based digital peripherals on each of the eight drive
* modes.
* \image html gpio_cpu_dm_block_diagram.png
*
* Below is a simplified output driver diagram that shows the pin view for
* fixed-function-based peripherals for each of the eight drive modes.
* \image html gpio_periio_dm_block_diagram.png
*
* - High-Impedance:
*   This is the standard high-impedance (HI-Z) state recommended for analog and
*   digital inputs. For digital signals, the input buffer is enabled; for analog
*   signals, the input buffer is typically disabled to reduce crowbar current
*   and leakage in low-power designs. To achieve the lowest device current, unused
*   GPIOs must be configured to the high-impedance drive mode with input buffer
*   disabled. Highimpedance drive mode with input buffer disabled is also the
*   default pin reset state.
*
* - Resistive Pull-Up or Resistive Pull-Down:
*   Resistive modes provide a series resistance in one of the data states and
*   strong drive in the other. Pins can be used for either digital input or
*   digital output in these modes. If resistive pull-up is required, a '1' must be
*   written to that pin's Data Register bit. If resistive pull-down is required,
*   a '0' must be written to that pin's Data Register. Interfacing mechanical
*   switches is a common application of these drive modes. The resistive modes are
*   also used to interface PSoC with open drain drive lines. Resistive pull-up is
*   used when the input is open drain low and resistive pull-down is used when the
*   input is open drain high.
*
* - Open Drain Drives High and Open Drain Drives Low:
*   Open drain modes provide high impedance in one of the data states and strong
*   drive in the other. Pins are useful as digital inputs or outputs in these
*   modes. Therefore, these modes are widely used in bidirectional digital
*   communication. Open drain drive high mode is used when the signal is
*   externally pulled down and open drain drive low is used when the signal is
*   externally pulled high. A common application for the open drain drives low
*   mode is driving I2C bus signal lines.
*
* - Strong Drive:
*   The strong drive mode is the standard digital output mode for pins; it
*   provides a strong CMOS output drive in both high and low states. Strong drive
*   mode pins should not be used as inputs under normal circumstances. This mode
*   is often used for digital output signals or to drive external devices.
*
* - Resistive Pull-Up and Resistive Pull-Down:
*   In the resistive pull-up and pull-down mode, the GPIO will have a series
*   resistance in both logic 1 and logic 0 output states. The high data state is
*   pulled up while the low data state is pulled down. This mode is useful when
*   the pin is driven by other signals that may cause shorts.
*/
#if defined (CY_IP_MXS22IOSS)
#define CY_GPIO_DM_CFG3_ENABLE_IN_OFF          (0x00UL) /**< Enables extra drive modes. Options are detailed in \ref group_gpio_extraDriveModes macros. Input buffer off */
#else
#define CY_GPIO_DM_ANALOG                      (0x00UL) /**< Analog High-Z. Input buffer off */
#endif /* CY_IP_MXS22IOSS */
#define CY_GPIO_DM_INVALID_IN_OFF              (0x01UL) /**< Invalid mode. It should not be used */
#define CY_GPIO_DM_PULLUP_IN_OFF               (0x02UL) /**< Resistive Pull-Up. Input buffer off */
#define CY_GPIO_DM_PULLDOWN_IN_OFF             (0x03UL) /**< Resistive Pull-Down. Input buffer off */
#define CY_GPIO_DM_OD_DRIVESLOW_IN_OFF         (0x04UL) /**< Open Drain, Drives Low. Input buffer off */
#define CY_GPIO_DM_OD_DRIVESHIGH_IN_OFF        (0x05UL) /**< Open Drain, Drives High. Input buffer off */
#define CY_GPIO_DM_STRONG_IN_OFF               (0x06UL) /**< Strong Drive. Input buffer off */
#define CY_GPIO_DM_PULLUP_DOWN_IN_OFF          (0x07UL) /**< Resistive Pull-Up/Down. Input buffer off */
#if defined (CY_IP_MXS22IOSS)
#define CY_GPIO_DM_CFG3_ENABLE                 (0x08UL) /**< Enables extra drive modes. Options are detailed in \ref group_gpio_extraDriveModes macros. Input buffer on */
#else
#define CY_GPIO_DM_HIGHZ                       (0x08UL) /**< Digital High-Z. Input buffer on */
#endif /* CY_IP_MXS22IOSS */
#define CY_GPIO_DM_INVALID                     (0x09UL) /**< Invalid mode. It should not be used */
#define CY_GPIO_DM_PULLUP                      (0x0AUL) /**< Resistive Pull-Up. Input buffer on */
#define CY_GPIO_DM_PULLDOWN                    (0x0BUL) /**< Resistive Pull-Down. Input buffer on */
#define CY_GPIO_DM_OD_DRIVESLOW                (0x0CUL) /**< Open Drain, Drives Low. Input buffer on */
#define CY_GPIO_DM_OD_DRIVESHIGH               (0x0DUL) /**< Open Drain, Drives High. Input buffer on */
#define CY_GPIO_DM_STRONG                      (0x0EUL) /**< Strong Drive. Input buffer on */
#define CY_GPIO_DM_PULLUP_DOWN                 (0x0FUL) /**< Resistive Pull-Up/Down. Input buffer on */
/** \} */

#if defined (CY_IP_MXS22IOSS)
/**
* \defgroup group_gpio_extDriveModes Extra pin drive mode
* \{
* Constants to be used for setting the extra drive mode of the pin. There are nine
* extra drive modes.
*
* \note
* These extra drive modes are available for the CAT1D devices.
*
*/
#define CY_GPIO_EXT_DM_HIGHZ                   (0x00UL) /**< High-impedance ( High-Z ) mode */
#define CY_GPIO_EXT_DM_PUPD                    (0x01UL) /**< When data_out is enabled strong drive, else pull_up and pull_down both are enabled */
#define CY_GPIO_EXT_DM_PULLUP                  (0x02UL) /**< When data_out is enabled strong drive, else pull_up is enabled */
#define CY_GPIO_EXT_DM_PULLDOWN                (0x03UL) /**< When data_out is enabled strong drive, else pull_down is enabled */
#define CY_GPIO_EXT_DM_OE0_HIZHIZ_0            (0x04UL) /**< When data_out is enabled strong drive, else high-impedance is enabled */
#define CY_GPIO_EXT_DM_OE0_HIZHIZ_1            (0x05UL) /**< When data_out is enabled strong drive, else high-impedance is enabled */
#define CY_GPIO_EXT_DM_OE0_HIZHIZ_2            (0x06UL) /**< When data_out is enabled strong drive, else high-impedance is enabled */
#define CY_GPIO_EXT_DM_OE0_PUPD                (0x07UL) /**< When data_out is enabled strong drive, else pull_up or pull _down is enabled as per the value of data_out */
#define CY_GPIO_EXT_DM_OE0_PUHIZ               (0x08UL) /**< When data_out is enabled strong drive, else pull_up or pull _down is enabled as per the value of data_out */
/** \} */
#endif /* CY_IP_MXS22IOSS */

/**
* \defgroup group_gpio_vtrip Voltage trip mode
* \{
* Constants to be used for setting the voltage trip type on the pin.
*/
#define CY_GPIO_VTRIP_CMOS                     (0x00UL) /**< Input buffer compatible with CMOS and I2C interfaces */
#define CY_GPIO_VTRIP_TTL                      (0x01UL) /**< Input buffer compatible with TTL and MediaLB interfaces */
/** \} */

#if (defined(CY_IP_MXS40IOSS) && (CY_IP_MXS40IOSS_VERSION == 3U)) || defined (CY_DOXYGEN)
/**
* \defgroup group_gpio_vtrip_auto Voltage trip automotive compatible mode
* \{
* Constants to be used for setting the input buffer automotive compatible mode (trip points and hysteresis) for GPIO upper bit.
*
* \note
* These macros are available for CAT1B devices.
*
*/
#define CY_GPIO_VTRIP_DIS_AUTO                 (0x00UL) /**< Input buffer is not compatible with automotive and it is compatible with CMOS/TTL interfaces */
#define CY_GPIO_VTRIP_SEL_AUTO                 (0x01UL) /**< Input buffer is compatible with automotive */
/** \} */
#endif/* CY_IP_MXS40IOSS_VERSION */

/**
* \defgroup group_gpio_slewRate Slew Rate Mode
* \{
* Constants to be used for setting the slew rate of the pin.
*/
#define CY_GPIO_SLEW_FAST                      (0x00UL) /**< Fast slew rate */
#define CY_GPIO_SLEW_SLOW                      (0x01UL) /**< Slow slew rate */
/** \} */

/**
* \defgroup group_gpio_driveStrength Pin drive strength
* \{
* Constants to be used for setting the drive strength of the pin.
*/
#define CY_GPIO_DRIVE_FULL                     (0x00UL) /**< Full drive strength: Max drive current */
#define CY_GPIO_DRIVE_1_2                      (0x01UL) /**< 1/2 drive strength: 1/2 drive current */
#define CY_GPIO_DRIVE_1_4                      (0x02UL) /**< 1/4 drive strength: 1/4 drive current */
#define CY_GPIO_DRIVE_1_8                      (0x03UL) /**< 1/8 drive strength: 1/8 drive current */
/** \} */

/**
* \defgroup group_gpio_interruptTrigger Interrupt trigger type
* \{
* Constants to be used for setting the interrupt trigger type on the pin.
*/
#define CY_GPIO_INTR_DISABLE                   (0x00UL) /**< Disable the pin interrupt generation */
#define CY_GPIO_INTR_RISING                    (0x01UL) /**< Rising-Edge interrupt */
#define CY_GPIO_INTR_FALLING                   (0x02UL) /**< Falling-Edge interrupt */
#define CY_GPIO_INTR_BOTH                      (0x03UL) /**< Both-Edge interrupt */
/** \} */

/**
* \defgroup group_gpio_sioVreg SIO output buffer mode
* \{
* Constants to be used for setting the SIO output buffer mode on the pin.
*/
#define CY_SIO_VREG_UNREGULATED                (0x00UL) /**< Unregulated output buffer */
#define CY_SIO_VREG_REGULATED                  (0x01UL) /**< Regulated output buffer */
/** \} */

/**
* \defgroup group_gpio_sioIbuf SIO input buffer mode
* \{
* Constants to be used for setting the SIO input buffer mode on the pin.
*/
#define CY_SIO_IBUF_SINGLEENDED                (0x00UL) /**< Single ended input buffer */
#define CY_SIO_IBUF_DIFFERENTIAL               (0x01UL) /**< Differential input buffer */
/** \} */

/**
* \defgroup group_gpio_sioVtrip SIO input buffer trip-point
* \{
* Constants to be used for setting the SIO input buffer trip-point of the pin.
*/
#define CY_SIO_VTRIP_CMOS                      (0x00UL) /**< CMOS input buffer (single-ended) */
#define CY_SIO_VTRIP_TTL                       (0x01UL) /**< TTL input buffer (single-ended) */
#define CY_SIO_VTRIP_0_5VDDIO_0_5VOH           (0x00UL) /**< 0.5xVddio or 0.5xVoh (differential) */
#define CY_SIO_VTRIP_0_4VDDIO_1_0VREF          (0x01UL) /**< 0.4xVddio or 0.4xVoh (differential) */
/** \} */

/**
* \defgroup group_gpio_sioVref SIO reference voltage for input buffer trip-point
* \{
* Constants to be used for setting the reference voltage of SIO input buffer trip-point.
*/
#define CY_SIO_VREF_PINREF                     (0x00UL) /**< Vref from analog pin */
#define CY_SIO_VREF_1_2V                       (0x01UL) /**< Vref from internal 1.2V reference */
#define CY_SIO_VREF_AMUX_A                     (0x02UL) /**< Vref from AMUXBUS_A */
#define CY_SIO_VREF_AMUX_B                     (0x03UL) /**< Vref from AMUXBUS_B */
/** \} */

/**
* \defgroup group_gpio_sioVoh Regulated output voltage level (Voh) and input buffer trip-point of an SIO pair
* \{
* Constants to be used for setting the Voh and input buffer trip-point of an SIO pair
*/
#define CY_SIO_VOH_1_00                        (0x00UL) /**< Voh = 1 x Reference */
#define CY_SIO_VOH_1_25                        (0x01UL) /**< Voh = 1.25 x Reference */
#define CY_SIO_VOH_1_49                        (0x02UL) /**< Voh = 1.49 x Reference */
#define CY_SIO_VOH_1_67                        (0x03UL) /**< Voh = 1.67 x Reference */
#define CY_SIO_VOH_2_08                        (0x04UL) /**< Voh = 2.08 x Reference */
#define CY_SIO_VOH_2_50                        (0x05UL) /**< Voh = 2.50 x Reference */
#define CY_SIO_VOH_2_78                        (0x06UL) /**< Voh = 2.78 x Reference */
#define CY_SIO_VOH_4_16                        (0x07UL) /**< Voh = 4.16 x Reference */
/** \} */

#if defined (CY_IP_MXS22IOSS)
/**
* \defgroup group_gpio_i3cPullUpMode I3C Pull-up mode
* \{
* Constants to be used for setting the I3C Pull-up mode on the pin.
*
* \note
* This parameter is available for the CAT1D devices.
*
*/
#define CY_GPIO_I3C_PULLUP_DISABLE             (0x00UL) /**< Disable additional Pull-ups */
#define CY_GPIO_I3C_PULLUP_570                 (0x07UL) /**< Pull-up 570 ohms */
#define CY_GPIO_I3C_PULLUP_720                 (0x06UL) /**< Pull-up 720 ohms */
#define CY_GPIO_I3C_PULLUP_840                 (0x05UL) /**< Pull-up 840 ohms */
#define CY_GPIO_I3C_PULLUP_1100                (0x03UL) /**< Pull-up 1100 ohms */
#define CY_GPIO_I3C_PULLUP_1200                (0x04UL) /**< Pull-up 1200 ohms */
#define CY_GPIO_I3C_PULLUP_1800                (0x02UL) /**< Pull-up 1800 ohms */
#define CY_GPIO_I3C_PULLUP_2800                (0x01UL) /**< Pull-up 2800 ohms */
/** \} */
#endif /* CY_IP_MXS22IOSS */

/** \} group_gpio_macros */

